; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=86, out_folder=htg/blocksworld/training, instance_id=66, seed=2090, goal_proportion=0.1

(define (problem blocksworld-66)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 - object)
 (:init 
    (arm-empty)
    (clear b58)
    (on b58 b27)
    (on-table b27)
    (clear b38)
    (on b38 b73)
    (on b73 b84)
    (on-table b84)
    (clear b35)
    (on b35 b76)
    (on b76 b63)
    (on b63 b74)
    (on b74 b39)
    (on b39 b65)
    (on b65 b66)
    (on b66 b48)
    (on-table b48)
    (clear b8)
    (on b8 b20)
    (on b20 b13)
    (on b13 b6)
    (on-table b6)
    (clear b23)
    (on b23 b44)
    (on b44 b29)
    (on b29 b15)
    (on b15 b72)
    (on-table b72)
    (clear b37)
    (on b37 b10)
    (on b10 b51)
    (on b51 b11)
    (on-table b11)
    (clear b43)
    (on-table b43)
    (clear b17)
    (on-table b17)
    (clear b4)
    (on b4 b19)
    (on-table b19)
    (clear b86)
    (on-table b86)
    (clear b7)
    (on b7 b31)
    (on b31 b78)
    (on b78 b21)
    (on b21 b59)
    (on b59 b53)
    (on-table b53)
    (clear b85)
    (on b85 b60)
    (on b60 b67)
    (on b67 b1)
    (on b1 b40)
    (on b40 b12)
    (on b12 b57)
    (on b57 b16)
    (on-table b16)
    (clear b81)
    (on b81 b77)
    (on-table b77)
    (clear b33)
    (on b33 b69)
    (on b69 b75)
    (on b75 b24)
    (on b24 b52)
    (on-table b52)
    (clear b28)
    (on b28 b79)
    (on b79 b5)
    (on b5 b83)
    (on-table b83)
    (clear b46)
    (on b46 b55)
    (on b55 b36)
    (on b36 b41)
    (on b41 b3)
    (on-table b3)
    (clear b68)
    (on-table b68)
    (clear b34)
    (on b34 b30)
    (on b30 b56)
    (on-table b56)
    (clear b62)
    (on-table b62)
    (clear b45)
    (on b45 b54)
    (on b54 b14)
    (on b14 b50)
    (on b50 b22)
    (on b22 b42)
    (on b42 b71)
    (on-table b71)
    (clear b82)
    (on-table b82)
    (clear b64)
    (on b64 b26)
    (on b26 b25)
    (on b25 b9)
    (on b9 b49)
    (on b49 b18)
    (on b18 b2)
    (on b2 b70)
    (on b70 b61)
    (on b61 b47)
    (on b47 b80)
    (on-table b80)
    (clear b32)
    (on-table b32))
 (:goal  (and 
    (clear b3)
    (on b3 b6)
    (on-table b6)
    (clear b2)
    (on b2 b8)
    (on-table b8)
    (clear b1)
    (on b1 b7)
    (on b7 b4)
    (on b4 b5)
    (on-table b5))))

; plan
1. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 1 of 11
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 11
3. (unstack b7 b31)
   deleted: (on b7 b31) (clear b7) (arm-empty)
   added: (holding b7) (clear b31)
   goals met: 2 of 11
4. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 3 of 11
5. (unstack b28 b79)
   deleted: (on b28 b79) (clear b28) (arm-empty)
   added: (holding b28) (clear b79)
   goals met: 3 of 11
6. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 3 of 11
7. (unstack b79 b5)
   deleted: (on b79 b5) (clear b79) (arm-empty)
   added: (holding b79) (clear b5)
   goals met: 3 of 11
8. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 3 of 11
9. (unstack b5 b83)
   deleted: (on b5 b83) (clear b5) (arm-empty)
   added: (holding b5) (clear b83)
   goals met: 3 of 11
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 11
11. (unstack b85 b60)
   deleted: (on b85 b60) (clear b85) (arm-empty)
   added: (holding b85) (clear b60)
   goals met: 4 of 11
12. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 4 of 11
13. (unstack b60 b67)
   deleted: (on b60 b67) (clear b60) (arm-empty)
   added: (holding b60) (clear b67)
   goals met: 4 of 11
14. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 4 of 11
15. (unstack b67 b1)
   deleted: (on b67 b1) (clear b67) (arm-empty)
   added: (holding b67) (clear b1)
   goals met: 5 of 11
16. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 5 of 11
17. (unstack b1 b40)
   deleted: (on b1 b40) (clear b1) (arm-empty)
   added: (holding b1) (clear b40)
   goals met: 4 of 11
18. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 6 of 11
19. (unstack b46 b55)
   deleted: (on b46 b55) (clear b46) (arm-empty)
   added: (holding b46) (clear b55)
   goals met: 6 of 11
20. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 6 of 11
21. (unstack b55 b36)
   deleted: (on b55 b36) (clear b55) (arm-empty)
   added: (holding b55) (clear b36)
   goals met: 6 of 11
22. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 6 of 11
23. (unstack b36 b41)
   deleted: (on b36 b41) (clear b36) (arm-empty)
   added: (holding b36) (clear b41)
   goals met: 6 of 11
24. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 6 of 11
25. (unstack b41 b3)
   deleted: (on b41 b3) (clear b41) (arm-empty)
   added: (holding b41) (clear b3)
   goals met: 7 of 11
26. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 7 of 11
27. (unstack b20 b13)
   deleted: (on b20 b13) (clear b20) (arm-empty)
   added: (holding b20) (clear b13)
   goals met: 7 of 11
28. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 7 of 11
29. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 7 of 11
30. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 7 of 11
31. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 11
32. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 8 of 11
33. (unstack b64 b26)
   deleted: (on b64 b26) (clear b64) (arm-empty)
   added: (holding b64) (clear b26)
   goals met: 8 of 11
34. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 8 of 11
35. (unstack b26 b25)
   deleted: (on b26 b25) (clear b26) (arm-empty)
   added: (holding b26) (clear b25)
   goals met: 8 of 11
36. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 8 of 11
37. (unstack b25 b9)
   deleted: (on b25 b9) (clear b25) (arm-empty)
   added: (holding b25) (clear b9)
   goals met: 8 of 11
38. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 8 of 11
39. (unstack b9 b49)
   deleted: (on b9 b49) (clear b9) (arm-empty)
   added: (holding b9) (clear b49)
   goals met: 8 of 11
40. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 8 of 11
41. (unstack b49 b18)
   deleted: (on b49 b18) (clear b49) (arm-empty)
   added: (holding b49) (clear b18)
   goals met: 8 of 11
42. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 8 of 11
43. (unstack b18 b2)
   deleted: (on b18 b2) (clear b18) (arm-empty)
   added: (holding b18) (clear b2)
   goals met: 9 of 11
44. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 9 of 11
45. (unstack b2 b70)
   deleted: (on b2 b70) (clear b2) (arm-empty)
   added: (holding b2) (clear b70)
   goals met: 8 of 11
46. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 11
47. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 8 of 11
48. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 11
49. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 8 of 11
50. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
51. (unstack b4 b19)
   deleted: (on b4 b19) (clear b4) (arm-empty)
   added: (holding b4) (clear b19)
   goals met: 8 of 11
52. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 9 of 11
53. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
54. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 10 of 11
55. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 11
56. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 11 of 11
